[M_RiggedRace MissionDefinition]
MissionDescription="During the family wars, Hudong's favorite race car is crashed by Mick Safford, forcing him to destroy every car in his path with explosives.."
TurnInDescription="The Saffords persisted until Hodges returned."
